# Family Symbol Get Structural Section Method

Source: https://www.revitapidocs.com/2026/99fb2804-0763-d6d1-13e7-7f49ff85fb68.htm

---

| Family Symbol Get Structural Section Method |
| --- |

Gets the structural section from element.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public StructuralSection GetStructuralSection()
```

```
Public Function GetStructuralSection As StructuralSection
```

```
public:
StructuralSection^ GetStructuralSection()
```

```
member GetStructuralSection : unit -> StructuralSection
```

#### Return Value

StructuralSection
The structural section. if the family symbol does not contain a structural section. Remarks Only beams, braces and structural columns can have a structural section.
 To check if the element can have structural section use the CanHaveStructuralSection method. See Also

#### Reference

FamilySymbol Class Autodesk.Revit.DB Namespace